<?php
$connect = new mysqli("localhost","root","","simplelogin");
// เป็นการเชื่อมต่อเข้าฐานข้อมูล หรือ เชื่อมต่อเข้า sql server โดยเก็บการเชื่อมต่อไว้ในตัวแปร connect

$connect->query('SET names utf-8');
// เป็นการป้องกันตัว sql อ่านภาษาไทยไม่ออก ให้รูปแบบข้อมูลเป็น utf-8

if ($connect->connect_errno) {
// ถ้า การเชื่อมต่อ ใน connect มีปัญหาหรือ error ให้ทำงานในนี้
// connect_errno คือ เป็นคำสั่งเอาไว้ใช้กับตัวแปรที่เก็บการเชื่อมต่อ ว่า เกิดข้อมผิดพลาดมั้ย errorมั้ย ถ้าไม่ ก็จะมีค่าเป็น false แต่ถ้ามีการ error หรือ เกิดการผิดพลาดจะมีเป็น True

    exit("Error-> ".$connect->connect_error);
    // exit คือการหยุดการทำงานของโปรแกรม หรือ หยุดการทำงานของโค้ด ทันที แล้วแสดงผลการ error ออกมา
    // connect_error คือ เป็นคำสั่งที่ใช้กับตัวแปรที่เก็บการเชื่อมต่อ เป็นการเก็บสิ่งที่ error เอาไว้ ดังนั้น จะนำ connect_error มาใช้แสดงผลเพื่อบอกว่ามีการ error อะไรบ้าง
}
?>